/-
Copyright (c) 2026 Lean FRO, LLC. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Kim Morrison
-/
import Mathlib.Tactic.NormRank

set_option maxHeartbeats 0

theorem result : Matrix.rank (R := ℚ) !![(1 : ℚ) / 2, (-9 : ℚ) / 2, (-3 : ℚ) / 2, (0 : ℚ) / 2, (-8 : ℚ) / 2, (-3 : ℚ) / 2, (4 : ℚ) / 2, (7 : ℚ) / 2;
  (9 : ℚ) / 3, (-7 : ℚ) / 3, (0 : ℚ) / 3, (-7 : ℚ) / 3, (8 : ℚ) / 3, (-5 : ℚ) / 3, (3 : ℚ) / 3, (-9 : ℚ) / 3;
  (-6 : ℚ) / 4, (1 : ℚ) / 4, (-2 : ℚ) / 4, (1 : ℚ) / 4, (-6 : ℚ) / 4, (-1 : ℚ) / 4, (0 : ℚ) / 4, (-1 : ℚ) / 4;
  (-8 : ℚ) / 5, (-4 : ℚ) / 5, (8 : ℚ) / 5, (-6 : ℚ) / 5, (-6 : ℚ) / 5, (5 : ℚ) / 5, (5 : ℚ) / 5, (-4 : ℚ) / 5;
  (-1 : ℚ) / 6, (-1 : ℚ) / 6, (-4 : ℚ) / 6, (-9 : ℚ) / 6, (2 : ℚ) / 6, (-6 : ℚ) / 6, (0 : ℚ) / 6, (8 : ℚ) / 6;
  (1 : ℚ) / 7, (6 : ℚ) / 7, (-6 : ℚ) / 7, (2 : ℚ) / 7, (2 : ℚ) / 7, (1 : ℚ) / 7, (2 : ℚ) / 7, (8 : ℚ) / 7;
  (-8 : ℚ) / 8, (5 : ℚ) / 8, (-8 : ℚ) / 8, (3 : ℚ) / 8, (8 : ℚ) / 8, (2 : ℚ) / 8, (8 : ℚ) / 8, (-8 : ℚ) / 8;
  (-7 : ℚ) / 9, (-7 : ℚ) / 9, (-5 : ℚ) / 9, (-5 : ℚ) / 9, (7 : ℚ) / 9, (0 : ℚ) / 9, (-5 : ℚ) / 9, (9 : ℚ) / 9] = 8 := by eval_rank

#print axioms result
