/-
Copyright (c) 2026 Lean FRO, LLC. All rights reserved.
Released under Apache 2.0 license as described in the file LICENSE.
Authors: Kim Morrison
-/
import HexRowReduceMathlib.Tactic

set_option maxHeartbeats 0
set_option maxRecDepth 100000
set_option profiler true
set_option profiler.threshold 1000000
set_option trace.HexMatrix.certificate true

theorem result : (!![4, -4, 4, 4, -4, 4, 4, -4; -4, 10, -10, 2, 10, 2, -10, -2; -4, -2, 7, -5, 3, -15, -3, 5; 4, 2, -7, 10, -8, 10, -2, -10; -4, -2, 7, 0, 4, -26, -2, 6; 4, -10, 15, 8, -16, 1, 1, -7; 4, 2, -7, 0, 8, 21, 26, 8; -4, 10, -5, 12, 16, -21, -16, -13] : Matrix (Fin 8) (Fin 8) ℚ) * !![(-5153 / 420), (-163 / 30), (-2132 / 105), (-1087 / 105), (211 / 105), (124 / 35), (-8 / 5), (14 / 5); (-3721 / 210), (-229 / 30), (-2881 / 105), (-1472 / 105), (52 / 21), (36 / 7), -2, 4; (-246 / 35), -3, (-1154 / 105), (-598 / 105), (103 / 105), (74 / 35), (-4 / 5), (8 / 5); (24 / 7), (8 / 5), (538 / 105), (559 / 210), (-73 / 210), (-32 / 35), (2 / 5), (-4 / 5); (26 / 7), (8 / 5), (577 / 105), (577 / 210), (-103 / 210), (-37 / 35), (2 / 5), (-4 / 5); (12 / 7), (4 / 5), (92 / 35), (46 / 35), (-9 / 35), (-16 / 35), (1 / 5), (-2 / 5); (-4 / 5), (-2 / 5), (-4 / 5), (-2 / 5), 0, (1 / 5), 0, (1 / 5); (-6 / 5), (-2 / 5), (-12 / 5), (-6 / 5), (2 / 5), (2 / 5), (-1 / 5), (1 / 5)] = 1 := by inverse

#print axioms result
